app/controllers/api/v1/concerts_controller.rb

  def index
    @concerts = Concert.where("artist ILIKE ?", "%#{params[:artist_name]}%")
    if @concerts.empty?
---
SELECT "concerts".* FROM "concerts" WHERE (artist ILIKE '%%')
SELECT  1 AS one FROM "concerts" WHERE (artist ILIKE '%%') LIMIT $1  [["LIMIT", 1]]
SELECT "concerts".* FROM "concerts"

  def show
    concert = Concert.find(params[:id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]