app/controllers/concerts_controller.rb

  def index
    @concerts = Concert.all.order("date ASC")
---
SELECT "concerts".* FROM "concerts" ORDER BY date DESC